<template>
	<div class="dealPopup">
      	<input ref='input' v-bind:value='value' style="display:none">
        <div class="popup1">
        <p v-show='show' @click='show=false' class="alignR">X</p>


 <p class='dealName'>猪猪集市平台用户服务协议</p>
本协议为您与猪猪集市平台管理者之间所订立的契约，具有合同的法律效力，请您仔细阅读。</p>
   <p class="dealTitle"> 一、 本协议内容、生效、变更</p>
<p>1.     本协议内容包括协议正文及所有猪猪集市已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何猪猪集市及其关联公司提供的服务（以下称为猪猪集市平台服务）均受本协议约束。
<p>2.     本协议中，“用户”为在猪猪集市发生包括但不限于浏览、活动、交易等行为的使用者。</p>
<p>3.     您应当在使用猪猪集市平台服务之前认真阅读全部协议内容。如果您对协议有任何疑问，应向猪猪集市咨询。您在同意所有协议条款并完成注册程序，才能成为本站的正式用户，您点击或勾选“我已经阅读并同意遵守《猪猪集市用户服务协议》”按钮后，本协议即生效，对双方产生约束力。</p>
<p>4.     只要您使用猪猪集市平台服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得猪猪集市对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</p>
<p>5.     您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
<p>6.     您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用猪猪集市平台服务。</p>
<p>7.     猪猪集市有权根据需要不定期地制订、修改本协议及/</p>或各类规则，并在猪猪集市平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用猪猪集市平台服务。您继续使用猪猪集市平台服务的，即表明您接受修订后的协议和规则。</p>
 
<p class="dealTitle">  二、 注册</p>
 
<p>1.     注册资格</p>
<p>用户须具有法定的相应权利能力和行为能力的自然人、法人或其他组织，能够独立承担法律责任。您完成注册程序或其他猪猪集市平台同意的方式实际使用本平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。若因您不具备主体资格，而导致的一切后果，由您及您的监护人自行承担。</p>
<p>2.     注册资料</p>
<p>2.1  用户应自行诚信向本站提供注册资料，用户同意其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，用户需承担因此引起的相应责任及后果，并且猪猪集市保留终止用户使用本平台各项服务的权利。</p>
<p>2.2  用户在本站进行浏览、下单购物等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，本站将予以严格保密，除非得到用户的授权或法律另有规定，本站不会向外界披露用户隐私信息。</p>
<p>3.     账户</p>
<p>3.1  您注册成功后，即成为猪猪集市平台的会员，将持有猪猪集市平台唯一编号的会员名和密码等账户信息，您可以根据本站规定改变您的密码。</p>
<p>3.2  您设置的会员名不得侵犯或涉嫌侵犯他人合法权益。否则，猪猪集市有权终止向您提供猪猪集市平台服务，注销您的账户。账户注销后，相应的会员名将开放给任意用户注册登记使用。</p>
<p>3.3  您应谨慎合理的保存、使用您的会员名和密码，应对通过您的会员名和密码实施的行为负责。除非有法律规定或司法裁定，且征得猪猪集市的同意，否则，会员名和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。</p>
<p>3.4  用户不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。</p>
<p>3.5  如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知猪猪集市，要求猪猪集市暂停相关服务，并向公安机关报案。您理解猪猪集市对您的请求采取行动需要合理时间，猪猪集市对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。</p>
<p>3.6  为方便您使用猪猪集市平台服务及猪猪集市关联公司或其他组织的服务（以下称其他服务），您同意并授权猪猪集市将您在注册、使用猪猪集市平台服务过程中提供、形成的信息传递给向您提供其他服务的猪猪集市关联公司或其他组织，或从提供其他服务的猪猪集市关联公司或其他组织获取您在注册、使用其他服务期间提供、形成的信息。</p>
<p>4.     用户信息的合理使用</p>
<p>4.1  您同意，猪猪集市平台拥有通过邮件、短信电话等形式，向在本站注册、交易用户、寄货人、收货人发送订单信息、促销活动等告知信息的权利。</p>
<p>4.2  您了解并同意，猪猪集市有权应国家司法、行政等主管部门的要求，向其提供您在猪猪集市平台填写的注册信息和交易记录等必要信息。如您涉嫌侵犯他人知识产权，则猪猪集市亦有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。</p>
<p>4.3  用户同意，猪猪集市有权使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</p>
 
<p>三、 猪猪集市平台服务规范</p>

<p>1.     通过猪猪集市及其关联公司提供的猪猪集市平台服务和其它服务，会员可在猪猪集市平台上发布交易信息、查询商品和服务信息、达成交易意向并进行交易、对其他会员进行评价、参加猪猪集市组织的活动以及使用其它信息服务及技术服务。</p>
<p>2.     在猪猪集市平台上使用猪猪集市服务过程中，您同意严格遵守以下义务：</p>
<p>2.1不得传输或发表损害国家、社会公共利益和涉及国家安全的信息资料或言论；</p>
<p>2.2不利用本站从事窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
<p>2.3不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为；</p>
<p>2.4不发布任何侵犯他人著作权、商标权等知识产权或合法权利的内容；</p>
<p>2.5不以虚构或歪曲事实的方式不当评价其他会员；</p>
<p>2.6不对猪猪集市平台上的任何数据作商业性利用，包括但不限于在未经猪猪集市事先书面同意的情况下，以复制、传播等任何方式使用猪猪集市平台上展示的资料。不使用任何装置、软件或程序干预猪猪集市平台的正常运营。</p>
<p>2.7本站保有删除站内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。</p>
<p>2.8您同意，若您未遵守以上规定的，本站有权作出独立判断并采取暂停或关闭用户帐号、订单等措施。</p>
<p>2.9经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者猪猪集市根据自身的判断，认为您的行为涉嫌违反本协议和/</p><p>或规则的条款或涉嫌违反法律法规的规定的，则猪猪集市有权在本平台上公示您的该等涉嫌违法或违约行为及猪猪集市已对您采取的措施。</p>
<p>2.10对于您在猪猪集市平台上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和/或规则的信息，猪猪集市有权不经通知您即予以删除，且按照规则的规定进行处罚。</p>
<p>2.11对于您在猪猪集市平台上实施的行为，包括您未在猪猪集市平台上实施但已经对猪猪集市平台及其用户产生影响的行为，猪猪集市有权单方认定您行为的性质及是否构成对本协议和/或规则的违反，并采取暂停或关闭用户帐号及其他措施。</p>
<p>2.12对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保猪猪集市免于因此产生损失或增加费用。</p>
<p>2.13如您涉嫌违反有关法律或者本协议之规定，使猪猪集市遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿猪猪集市因此造成的损失及（或）发生的费用，包括合理的律师费用。</p>
 
<p>四、订单</p>
 
<p>1.     在本网站平台交易的用户，请您仔细确认所售卖商品或者所购买商品的名称、价格、数量、型号、规格、尺寸等信息。因交易商品为二手物件，请买卖双方谨慎交易。在下单时须完整填写您希望购买的商品数量、价款及支付方式、收货人、联系方式、收货地址等内容。</p>
<p>2.     系统生成的订单信息是计算机信息系统根据买卖双方填写的内容自动生成的数据，仅是买家向卖家发出的合同要约；卖家收到买家的订单信息后，将订单中的商品从卖家向买家发出时，方视为买家与卖家之间就实际发出的商品建立了合同关系；如果一份订单里订购了多种商品并且卖家只给您发出了部分商品时，买家与卖家之间仅就实际向买家发出的商品建立了合同关系。</p>
<p>3.     您了解并同意，本平台上的商品、价格、数量、是否有货等商品信息随时可能发生变动，本站不作特别通知。由于互联网技术原因导致网页显示信息可能会有一定的滞后性或差错，对此在合同未成立前，您接受本平台在发现网页错误，正式向您发出通知后，对商品信息进行调整，订单按照正确的信息执行，或取消订单。</p>
<p>4.     您可以随时登陆您在本站注册的账户，查询您的订单状态。</p>
<p>5.     您了解并同意，如您购买商品，发生缺货，您有权取消订单；本平台无法保证您提交的订单信息中希望购买的商品都会有货。</p>
<p>6.卖家将会把商品（货物）送到您所指定的收货地址。您了解本平台所提示的送货时间供参考，实际送货会与参考时间略有差异。平台管理者和所有者或其关联公司不对因您及收货人原因导致无法送货或延迟送货承担责任。若发生不可抗力或其他正当合理理由导致<p>发货延迟的，您将给予充分理解。</p>
 
<p>五、责任范围和责任限制</p>
 
<p>1.     本平台作为您进行了解、咨询、协商、交易的场所，提示您：应谨慎判断确定相关物品及/</p>或信息的真实性、合法性和有效性。除非另有明确的书面说明，本平台不对各卖家在本平台上发布的信息、内容、材料、产品和服务及各方在交易中各项义务的履行能力作任何形式的担保，法律法规另有规定的除外。</p>
<p>2.     猪猪集市在接到您投诉、主管机关通知或按照法律法规规定，有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形时,猪猪集市可依约定或依法采取相应措施。</p>
<p>3.     您了解并同意，猪猪集市不对因下述任一情况而导致您的任何损害承担赔偿责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿：</p>
<p>3.1第三方未经批准的使用您的账户或更改您的数据。</p>
<p>3.2您对猪猪集市平台服务的误解。</p>
<p>3.3任何非因猪猪集市的原因而引起的与猪猪集市平台服务有关的其它损失。</p>
<p>4.     由于法律规定的不可抗力，信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，劳动争议，生产力或生产资料不足，司法行政机关的命令或第三方的不作为及其他本平台无法控制的原因造成的本平台不能服务或延迟服务、丢失数据信息、记录的，猪猪集市不承担责任，但猪猪集市将协助处理相关事宜。</p>
 
<p>六、协议终止</p>
 
<p>1.     您同意，猪猪集市有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部猪猪集市平台服务，暂时冻结或永久冻结（注销）您的账户，且无须为此向您或任何第三方承担任何责任。</p>
<p>2.     出现以下情况时，猪猪集市有权直接以注销账户的方式终止本协议:</p>
<p>2.1猪猪集市终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为猪猪集市用户的；</p>
<p>2.2您提供的电子邮箱不存在或无法接收电子邮件，且没有其他方式可以与您进行联系，或猪猪集市以其它联系方式通知您更改电子邮件信息，而您在猪猪集市通知后三个工作日内仍未更改为有效的电子邮箱的。</p>
<p>2.3您注册信息中的主要内容不真实或不准确或不及时或不完整。</p>
<p>2.4本协议（含规则）变更时，您明示并通知猪猪集市不愿接受新的服务协议的；</p>
<p>2.5其它猪猪集市认为应当终止服务的情况。</p>
<p>3.     您有权向猪猪集市要求注销您的账户，经猪猪集市审核同意的，猪猪集市注销（永久冻结）您的账户，届时，您与猪猪集市基于本协议的合同关系即终止。您的账户被注销（永久冻结）后，猪猪集市没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。</p>
<p>4.     您同意，您与猪猪集市的合同关系终止后，猪猪集市仍享有下列权利：</p>
<p>4.1  继续保存您的注册信息及您使用猪猪集市平台服务期间的所有交易信息。</p>
<p>4.2  您在使用猪猪集市平台服务期间存在违法行为或违反本协议和/或规则的行为的，猪猪集市仍可依据本协议向您主张权利。</p>
<p>5.     猪猪集市中止或终止向您提供猪猪集市平台服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保猪猪集市免于因此产生任何损失或承担任何费用：</p>
<p>5.1  您在服务中止或终止之前已经上传至猪猪集市平台的物品尚未交易的，猪猪集市有权在中止或终止服务的同时删除此项物品的相关信息；</p>
<p>5.2  您在服务中止或终止之前已经与其他会员达成买卖合同，但合同尚未实际履行的，猪猪集市有权删除该买卖合同及其交易物品的相关信息；</p>
<p>5.3  您在服务中止或终止之前已经与其他会员达成买卖合同且已部分履行的，猪猪集市可以不删除该项交易，但猪猪集市有权在中止或终止服务的同时将相关情形通知您的交易对方。</p>
 
<p>七、法律适用、管辖与其他</p>
 
<p>1.     本协议包含了您使用猪猪集市平台需遵守的一般性规范，您在使用某个猪猪集市平台时还需遵守适用于该平台的特殊性规范。一般性规范如与特殊性规范不一致或有冲突，则特殊性规范具有优先效力。</p>
<p>2.     本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。 如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。</p>
<p>3.     因本协议履行过程中，因您使用猪猪集市服务产生争议应由猪猪集市与您沟通并协商处理。协商不成时，双方均同意以猪猪集市平台管理者住所地人民法院为管辖法院。</p>

        </div>
    </div>
</template>    
<script>
import { Popup,TransferDom} from 'vux'
export default {
  directives: {
    TransferDom
  },
  mounted () {
    let self=this;
    this.setTitle("平台规范");
  },
  props:{
  	value:'',
  },
  data () {
    return {
    	show:false
    }
  },
  methods:{
  },
  watch: {
  	value(val){
  		if(val){
	  		this.show=true;
  		}
  	},
  	show(val){
      let self=this;
  		if(!val){
  			self.$emit("listenToDealShow",val)
  		}
  	}
	},
   components: {
    Popup,
    TransferDom,  
  },
}

</script>

<style scoped lang='less'>
    .dealPopup{
      font-size: 26/40rem;
      background-color: #fff;
      overflow: auto;
      line-height: 50/40rem;
      height: 100%;
      position: absolute;
      z-index: 999;
    }
    .popup1{
      padding: 30/40rem;
    }
    .dealName{
      text-align: center;
      font-size: 34/40rem;
      font-weight: 600;
    }
    .dealTitle{
      font-size: 28/40rem;
      margin: 10/40rem 0;
      font-weight: 600;
    }
</style>