<template>
	<div class="dealPopup">
        <div class="popup1">
        <p v-show='show' @click='show=false' class="alignR"><span>X</span></p>
        <p class='dealName'>猪猪集市竞拍协议</p>
<p>本协议为您与猪猪集市平台管理者之间所订立的契约，具有合同的法律效力，请您仔细阅读。</p>
<p>猪猪集市仅向您提供拍卖技术平台，其中，本协议项下的互联网信息服务、网站空间、网站相关技术支持和服务由深圳市猪猪集市科技有限公司提供，拍卖技术平台上的拍品信息及拍品相关描述（以下统称“拍品信息”）均由卖家自主发布，您通过猪猪集市查询、浏览拍品信息并参与竞拍且竞拍成功的，您将受到您与卖家之间达成的买卖合同的约束。 </p>

   <p class="dealTitle"> 一、 本协议内容、生效、变更</p>

<p>1.本协议内容包括协议正文及所有猪猪集市已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何猪猪集市及其关联公司提供的服务（以下称为猪猪集市平台服务）均受本协议约束。</p>
<p>2.本协议中，“用户”为在猪猪集市发生包括但不限于浏览、活动、交易等行为的使用者。</p>
<p>3.您应当在使用猪猪集市平台的竞拍服务之前认真阅读全部协议内容。如果您对协议有任何疑问，应向猪猪集市咨询。您在同意所有协议条款并完成注册程序，本协议即生效，对双方产生约束力，您需完成注册才能成为本站的正式用户并参与竞拍服务。</p>
<p>4.只要您使用猪猪集市平台的竞拍服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得猪猪集市对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</p>
<p>5.您确认：本协议条款是处理双方权利义务的契约，始终有效，法律另有强制性规定或双方另有特别约定的，依其规定。</p>
<p>6.您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用猪猪集市平台服务。</p>
<p>7.猪猪集市有权根据需要不定期地制订、修改本协议及/或各类规则，并在猪猪集市平台公示，不再另行单独通知用户。变更后的协议和规则一经在网站公布，立即生效。如您不同意相关变更，应当立即停止使用猪猪集市平台服务。您继续使用猪猪集市平台服务的，即表明您接受修订后的协议和规则。</p>

<p class="dealTitle">二、 定义 </p>

     <p>1.拍卖：是指卖家以拍卖方式发布拍品，采用公开竞价形式，由竞拍成功者最终获得拍品的交易方式。 </p>
     <p>2.竞拍成功者：指竞拍中获胜，最终有权购得拍品的买家。 </p>
     <p>3.拍卖营销活动：指猪猪集市组织的拍品推广活动，包括日常拍品活动和节庆促销等主题专场活动。 </p>
   <p class="dealTitle">三、 参与竞拍条件</p>

     <p>1.符合以下条件的买家方能参与竞拍： </p>
     <p>2.其已确认接受《猪猪集市平台用户服务协议》，注册并成为猪猪集市的用户； </p>
     <p>3.其账户中有足够的余额用于猪猪集市在其出价时止付锁定拍卖保证金； </p>
     <p>4.猪猪集市未拒绝其参与竞拍的申请。 </p>

<p class="dealTitle">四、 竞拍服务及买家义务 </p>

     <p>1.    猪猪集市同意向买家提供稳定的竞拍平台技术服务，使买家参与的竞拍得以顺利进行；买家同意严格按照本协议约定使用竞拍平台技术服务。 </p>
     <p>2.    在拍卖有效期内您确认出价的，根据卖家设置的保证金类型猪猪集市有权在您的账户中自动锁定相应金额的拍卖保证金；如您符合猪猪集市竞拍保证金释放条件时，猪猪集市有权释放保证金。 </p>
     <p>3.    您应当按照本协议、附件以及所有猪猪集市已经发布的或将来可能发布的各类规则、操作流程参与竞拍，遵守相关出价、获得拍品、成交价格、拍卖保证金止付锁定/释放/赔付等各类规定。 </p>
     <p>4.    您确认，因部分卖家的拍卖活动须向有关工商行政管理部门申报并提供买家（含所有参与竞拍的买家）的相关身份信息，如您参与竞拍的拍品属于该部分卖家提供的拍品，则您同意将您的身份信息（包含但不限于姓名、身份证件号码、住址等）提供给卖家用于卖家向工商行政管理部门申报之用，具体提供方式为：在您签署本协议后，在网络页面中填写相关身份信息。 </p>

<p class="dealTitle">五、买家竞拍不买的责任 </p>

     <p>1.    竞拍成功后，买家须按照规定完成交易，不得竞拍不买。买家若发生以下任一情形，</p>
将视为竞拍不买，但买卖双方另有约定或卖家原因导致的除外： </p>
<p>1.1    在竞拍结束之时起的3天内，拒绝按照成交价格支付拍品货款； </p>
<p>1.2    为了猪猪集市的拍卖交易秩序，防止买家恶拍，尽量避免并妥善处理买卖双方之间的交易纠纷，您参与竞拍时止付锁定的保证金将为本次竞拍提供保障。如您出现竞拍不买行为，您同意猪猪集市有权划扣您的拍卖保证金用于赔付卖家；且猪猪集市仍有权按照相关规则的规定对您进行处理。 </p>

<p class="dealTitle">六、责任范围和责任限制</p>
 
<p>1.     本平台作为您进行了解、咨询、协商、交易的场所，提示您：应谨慎判断确定相关物品及/或信息的真实性、合法性和有效性。除非另有明确的书面说明，本平台不对各卖家在本平台<p>上发布的信息、内容、材料、产品和服务及各方在交易中各项义务的履行能力作任何形式的担保，法律法规另有规定的除外。</p>
<p>2.猪猪集市在接到您投诉、主管机关通知或按照法律法规规定，有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形时,猪猪集市可依约定或依法采取相应措施。</p>
<p>3.您了解并同意，猪猪集市不对因下述任一情况而导致您的任何损害承担赔偿责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿：</p>
<p>3.1第三方未经批准的使用您的账户或更改您的数据。</p>
<p>3.2您对猪猪集市平台服务的误解。</p>
<p>3.3任何非因猪猪集市的原因而引起的与猪猪集市平台服务有关的其它损失。</p>
<p>4.由于法律规定的不可抗力，信息网络正常的设备维护，信息网络连接故障，电脑、通讯或其他系统的故障，电力故障，劳动争议，生产力或生产资料不足，司法行政机关的命令或第三方的不作为及其他本平台无法控制的原因造成的本平台不能服务或延迟服务、丢失数据信息、记录的，猪猪集市不承担责任，但猪猪集市将协助处理相关事宜。</p>

<p class="dealTitle">七、协议终止</p>
 
<p>1.您同意，猪猪集市有权自行全权决定以任何理由不经事先通知的中止、终止向您提供部分或全部猪猪集市平台服务，暂时冻结或永久冻结（注销）您的账户，且无须为此向您或任何第三方承担任何责任。</p>
<p>2.出现以下情况时，猪猪集市有权直接以注销账户的方式终止本协议:</p>
<p>2.1猪猪集市终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为猪猪集市用户的；</p>
<p>2.2您提供的电子邮箱不存在或无法接收电子邮件，且没有其他方式可以与您进行联系，或猪猪集市以其它联系方式通知您更改电子邮件信息，而您在猪猪集市通知后三个工作日内仍未更改为有效的电子邮箱的。</p>
<p>2.3您注册信息中的主要内容不真实或不准确或不及时或不完整。</p>
<p>2.4本协议（含规则）变更时，您明示并通知猪猪集市不愿接受新的服务协议的；</p>
<p>2.5其它猪猪集市认为应当终止服务的情况。</p>
<p>3. 您有权向猪猪集市要求注销您的账户，经猪猪集市审核同意的，猪猪集市注销（永久冻结）您的账户，届时，您与猪猪集市基于本协议的合同关系即终止。您的账户被注</p>
销（永久冻结）后，猪猪集市没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。</p>
<p>4.您同意，您与猪猪集市的合同关系终止后，猪猪集市仍享有下列权利：</p>
<p>4.1  继续保存您的注册信息及您使用猪猪集市平台服务期间的所有交易信息。</p>
<p>4.2  您在使用猪猪集市平台服务期间存在违法行为或违反本协议和/或规则的行为的，猪猪集市仍可依据本协议向您主张权利。</p>
<p>5.猪猪集市中止或终止向您提供猪猪集市平台服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保猪猪集市免于因此产生任何损失或承担任何费用：</p>
<p>5.1  您在服务中止或终止之前已经上传至猪猪集市平台的物品尚未交易的，猪猪集市有权在中止或终止服务的同时删除此项物品的相关信息；</p>
<p>5.2  您在服务中止或终止之前已经与其他会员达成买卖合同，但合同尚未实际履行的，猪猪集市有权删除该买卖合同及其交易物品的相关信息；</p>
<p>5.3  您在服务中止或终止之前已经与其他会员达成买卖合同且已部分履行的，猪猪集市可以不删除该项交易，但猪猪集市有权在中止或终止服务的同时将相关情形通知您的交易对方。</p>
 
<p class="dealTitle">八、法律适用、管辖与其他</p>
 
<p>1.本协议包含了您使用猪猪集市平台需遵守的一般性规范，您在使用某个猪猪集市平台时还需遵守适用于该平台的特殊性规范。一般性规范如与特殊性规范不一致或有冲突，则特殊性规范具有优先效力。</p>
<p>2.本协议的订立、执行和解释及争议的解决均应适用在中华人民共和国大陆地区适用之有效法律（但不包括其冲突法规则）。 如发生本协议与适用之法律相抵触时，则这些条款将完全按法律规定重新解释，而其它有效条款继续有效。</p>
<p>3.因本协议履行过程中，因您使用猪猪集市服务产生争议应由猪猪集市与您沟通并协商处理。协商不成时，双方均同意以猪猪集市平台管理者住所地人民法院为管辖法院。</p>
        </div>
    </div>
</template>    
<script>
import { Popup,TransferDom} from 'vux'
import ImgUpload from '@/components/ImgUpload'
// var url = require('aUrl')
export default {
  directives: {
    TransferDom
  },
  mounted () {
    let self=this;
    this.setTitle("竞拍协议");
  },
  props:{
  	value:'',
  },
  data () {
    return {
    	show:false
    }
  },
  methods:{
  },
  watch: {
  	value(val){
  		if(val){
	  		this.show=true;
  		}
  	},
  	show(val){
      let self=this;
  		if(!val){
  			self.$emit("listenToDealShow",val)
  		}
  	}
	},
   components: {
    Popup,
    TransferDom,  
  },
}

</script>

<style scoped lang='less'>
    .dealPopup{
      font-size: 26/40rem;
      background-color: #fff;
      overflow: auto;
      line-height: 50/40rem;
      height: 100%;
      position: absolute;
      z-index: 999;
    }
    .popup1{
      padding: 30/40rem;
    }
    .dealName{
      text-align: center;
      font-size: 34/40rem;
      font-weight: 600;
    }
    .dealTitle{
      font-size: 28/40rem;
      margin: 10/40rem 0;
      font-weight: 600;
    }
</style>