<template>
	<div class="dealPopup">
        <div class="popup1">
        <p v-show='show' @click='show=false' class="alignR">X</p>
        <p class='dealName'>猪猪集市闲置交易公约</p>
<p class="dealTitle">一、猪猪集市介绍</p>
  <p>猪猪集市是一个让用户可以便利快捷地交易闲置物品的线上平台。用户只需注册用户账号，无需开店，即可成为猪猪集市卖家售卖闲置物品。1分钟便可完成发布，随时随地管理在线宝贝和交易订单，操作简便。</p>
  <p>在猪猪集市有包括但不限于浏览、活动、交易等行为的用户，需遵循国家法律法规、《猪猪集市平台用户服务协议》、《猪猪集市交易公约》。</p>

<p class="dealTitle">二、猪猪集市交易流程</p>
  <p>卖家发布商品——买家在猪猪集市拍下宝贝——等待买家付款（逾期未付款则该交易自动取消）——买家支付——卖家发货（卖家可选择通过快递公司发货，或由买卖双方自行约定收货时间和地点。如交易虚拟商品或线下交易，则在生成订单后卖家在发货选项中选择“无需物流”）——买家确认收货（买家超时未确认收货，系统将默认收货）——卖家收到货款</p>

<p class="dealTitle">三、猪猪集市交易原则 </p>
  <p>1.交易对象</p>
  <p>买卖双方都是平等的，线上交易卖家在操作“我要发货”前，买卖双方均有选择最终交易对象的权利。</p>
  <p>2.交易约定</p>
  <p>交易前，买卖双方需针对商品情况及交易方式进行详细的沟通约定，并保存通过猪猪集市平台的沟通凭证（非通过猪猪集市平台的沟通凭证，买卖双方在仲裁或举证时视为无效材料）。线上交易卖家在操作“我要发货”即表示买卖双方达成交易约定。</p>
  <p>3.卖家如实描述要求</p></p>
  <p>卖家需对商品的基本属性、使用时长、成色、具体瑕疵（破损、裂痕、划痕等）、维修记录、质量问题及保质期等必须说明的信息进行真实完整的描述。</p>
  <p>4.买家验货要求</p>
  <p>实物在线交易：买家签收商品需对商品进行验货，如有问题需在确认收货之前提出异议，并通过猪猪集市与卖家协商处理。</p>
  <p>虚拟商品交易：卖家发货，买家在确认收货前进行验货，如有问题买家需在确认收货前申请退货退款。</p>
  <p>线下交易：买家与卖家发生线下交易，需当面验货，如果验货通过方可在猪猪集市平台当面完成支付；如有问题需双方协商处理，若协商未果，买家可在卖家发货起第8到第10个自然日内申请仲裁。</p>
  <p>注：猪猪集市不支持无理由退货服务。以上交易，在确认收货之后不可申请退货退款或仲裁。</p>
<p class="dealTitle">四、交易商品约定</p>
  <p>1.买卖双方必须秉持诚信交易原则，卖家不可故意夸大实物从而误导买家；买家不可刻意损坏物品从而获取退款或退货机会；一旦发生此类事件，利益受损方可向猪猪集市客服寻求协助，客服介入调查解决。</p>
  <p>2.闲置交易本身是个体闲置或二手物品的出售，所以在购买前请双方就细节问题认真沟通，以免造成不必要的误会和麻烦，买家可以要求卖家多拍实物图。</p>
  <p>3.订单待付款状态：买卖双方可取消商品交易。</p>
  <p>4.订单待发货状态：卖家可单方面取消订单，买家可申请退款，款项将原路返回。</p>
  <p>5.订单待收货状态：选择快递发货的交易，买家如果对商品有异议，与卖家沟通协商后，可在发货起7个自然日内申请退货退款；选择“无需物流”的交易，买家如果对商品有异议或者未收到货物，与卖家沟通协商无果后，可在发货后第8到第10个自然日内申请仲裁。</p>
  <p>4.卖家若涉嫌虚假物品交易，骗取钱财、滥发信息，经买家投诉，客服审核通过后，将冻结该卖家的账号。</p>
  <p>5.买卖双方只可交易闲置物，不可进行商业代购或商业买卖。一旦收到投诉或经由客服发现，将冻结其账号。</p>

<p class="dealTitle">五、交易超时时间
  <p>付款超时：买家拍下货物时，逾期未付款，则系统自动取消交易，该商品自动重新上架，所有买家可以重新拍买。</p>
  <p>退款处理超时：买家在猪猪集市平台申请退款后7个自然日内，若卖家未处理该退款申请，钱款将按买家原支付路径自动退回。</p>
  <p>退货超时：买家在猪猪集市平台申请退货退款，卖家同意该退货退款后7个自然日内，若买家未填写物流信息，则交易关闭，钱款将退回卖家。</p>
  <p>收货确认超时：卖家发货后，若7个自然日内买家未确认收货也未申请退货退款，则系统默认买家已收货，会将货款支付给卖家。</p>

<p class="dealTitle">六、交易争议处理 </p>
  <p>1.买卖双方出现争议，可申请客服介入协助处理，可能涉及的买卖双方争议包括但不限于以下几种情形：</p>
  <p>卖家实物与描述不符合或出现质量问题；</p>
  <p>由于发货或物流等原因，导致买家未收到货、拒绝签收商品或签收后退回商品的；</p>
  <p>双方约定不清，无法确定争议的责任归属的；</p>
  <p>卖家收到退回的货物后，不确认退货，不予退款的；</p>
  <p>买家恶意损坏商品并要求卖家退款；</p>
  <p>其他买卖双方提交至客服的仲裁事项。</p>

 <p>2.出现以下情形之一，猪猪集市客服不予处理，交由买卖双方自行协调：</p>
 <p>因商品存在危机人身财产权、人身健康权的不合理危险，导致买家损失的；</p>
 <p>买家逾期未根据协议约定或猪猪集市规定的退货时间内操作退货的；</p>
 <p>商品在收退货过程中因物流公司的原因导致毁损、丢失的；</p>
 <p>买卖双提供的证据（如双方的聊天记录）不是出自猪猪集市平台的；</p>
 <p>所有订单确认收货之后不可申请退货退款以及仲裁；</p>
 <p>买卖双方采用当面交付的方式进行交易。</p>
 <p>3.猪猪集市客服处理纠纷时，出现以下情况之一，有权终止协调和处理争议：</p>
 <p>买卖双方明确要求自行处理争议；</p>
 <p>买卖双方任何一方通知猪猪集市即将通过司法途径解决争议。</p>

 <p>4.违约赔偿</p>
 <p>买卖双方任何一方违约，违约方应承担违约责任。猪猪集市有权调查并收集违约证据。用户违反有关法律、法规、公共道德或本协议项下的任何条款均构成违约。给其他第三人造成损失的，责任方应当承担由此造成的一切损失。猪猪集市有权视情况终止其用户资格，所收费用/保证金（如有）不予退还。</p>

<p class="dealTitle">七、用户行为规范</p>
  <p>1.不得进行骗取他人财物的欺诈行为。</p>
  <p>2.不得频繁异常地发生交易纠纷导致他人资损。</p>
  <p>3.不得发布国家法律不允许的违禁商品信息。</p>
  <p>4.不得发布假货。</p>
  <p>5.不得发布猪猪集市以外平台联系方式的风险商品信息。</p>
  <p>6.不得发布任何广告信息，包括但不限于：拉人、刷单、兼职等。</p>
  <p>7.不得发布存在交易风险的虚拟商品信息。</p>
  <p>8.不得频繁重复发布垃圾广告。</p>
  <p>9.不得发布泄露他人隐私内容。</p>
  <p>10.不得以侮辱、诽谤等方式对他人进行人身攻击。</p>
        </div>
    </div>
</template>    
<script>
import { Popup,TransferDom} from 'vux'
export default {
  directives: {
    TransferDom
  },
  mounted () {
    let self=this;
    this.setTitle("服务条款");
  },
  props:{
  	value:'',
  },
  data () {
    return {
    	show:false
    }
  },
  methods:{
  },
  watch: {
    value(val){
      if(val){
        this.show=true;
      }
    },
  	show(val){
      let self=this;
  		if(!val){
        self.$emit("listenToDealShow",val)
  		}
  	}
	},
   components: {
    Popup,
    TransferDom,  
  },
}

</script>

<style scoped lang='less'>
     .dealPopup{
      font-size: 26/40rem;
      background-color: #fff;
      overflow: auto;
      line-height: 50/40rem;
      height: 100%;
      position: absolute;
      z-index: 999;
    }
    .popup1{
      padding: 30/40rem;
    }
    .dealName{
      text-align: center;
      font-size: 34/40rem;
      font-weight: 600;
    }
    .dealTitle{
      font-size: 28/40rem;
      margin: 10/40rem 0;
      font-weight: 600;
    }
</style>